Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Resume the task awaiting the continuation by having it either return normally or throw an error based on the state of the given Result value.
ja: 継続を待っているタスクを、それにそれの中断地点からこの与えられたResult値の状態に基づいて通常に復帰させるかエラーをスローさせるかどちらかによって再開します。

source: Resume the task awaiting the continuation by having it return normally from its suspension point.
ja: 継続を待っているタスクを、それにそれの中断地点から通常に復帰させることによって再開します。

source: Resume the task awaiting the continuation by having it throw an error from its suspension point.
ja: 継続を待っているタスクを、それにそれの中断地点からエラーをスローさせることによって再開します。

source: Resume the task awaiting the next iteration point by having it return nil or throw which signifies the end of the iteration.
ja: 次の反復地点を待っているタスクを、それに反復の終わりを意味するnilを返させるまたはスローさせることによって再開します。

source: Resume the task awaiting the next iteration point by having it return nil which signifies the end of the iteration.
ja: 次の反復地点を待っているタスクを、それに反復の終わりを意味するnilを返させることによって再開します。

source: Resume the task awaiting the next iteration point by having it return nomally from its suspension point or buffer the value if no awaiting next iteration is active.
ja: 次の反復地点を待っているタスクを、それに通常に復帰させることによってそれの中断地点から再開します。または待っている次の反復が活動中でないならば値をバッファに移します。

source: Resume the task awaiting the next iteration point by having it return normally from its suspension point or buffer the value if no awaiting next iteration is active where the Element is Void.
ja: 次の反復地点を待っているタスクを、それに通常に復帰させることによってそれの中断地点から再開します。または待っている次の反復が活動中でないならば値をバッファに移します、そこでElementはVoidです。

source: Resume the task awaiting the next iteration point by having it return normally from its suspension point or buffer the value if no awaiting next iteration is active.
ja: 次の反復地点を待っているタスクを、それに通常に復帰させることによってそれの中断地点から再開します。または待っている次の反復が活動中でないならば値をバッファに移します。

source: Resuming from a continuation more than once is undefined behavior.
ja: ある継続から一回以上再開することは、未定義挙動です。

source: Retrieve or set the Pointee instance referenced by self.
ja: selfによって参照されるPointeeインスタンスを回収または設定します。

source: Retrieve the executor for this actor as an optimized, unowned reference.
ja: エグゼキュータ（遂行者）をこのアクターのためにある最適化された、非所有参照として取って来ます。

source: Retrieve the localized description for this error.
ja: このエラーの現地語化された説明を取ってきます。

source: Return Value
ja: 戻り値

source: Returns -1 if this value is negative and 1 if it’s positive; otherwise, 0.
ja: この値が負ならば-1そしてそれが正ならば1；それ以外では0を返します。

source: Returns nil, indicating that there are no more elements.
ja: もう要素は無いことを指し示す、nilを返します。

source: Returns true if the task is cancelled, and should stop executing.
ja: trueを返します、もしタスクが取り消される、そして遂行を停止すべきならば。

source: Returns true if this value is a multiple of the given value, and false otherwise.
ja: trueをもしこの値がその与えられた値の倍数ならば、そしてfalseをそうでないならば返します。

source: Returns a CVaListPointer that is backed by autoreleased storage, built from the given array of arguments.
ja: オートリリースされるストレージによって裏付けられるCVaListPointerを返します、いくらかの引数からなる与えられた配列から組み立てられます。

source: Returns a Boolean value indicating whether a value is included in a range.
ja: 値が範囲に含まれるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether any corresponding components of the two tuples are not equal.
ja: ２つのタプルの対応する構成要素いずれかが等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether every element of a sequence satisfies a given predicate.
ja: シーケンスのすべての要素がある与えられた述部を満たすかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the corresponding components of two tuples are equal.
ja: ２つのタプルの対応する構成要素らが等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the first argument represents a position before the second argument.
ja: 最初の引数が２番目の引数の前の位置を表すかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the first tuple is ordered after or the same as the second in a lexicographical ordering.
ja: 語彙筆記的順序において最初のタプルが２番目の後ろまたはそれと同じ順序かかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether the first tuple is ordered after the second in a lexicographical ordering.
ja: 語彙筆記的順序において最初のタプルが２番目の後ろの順序かかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether the first tuple is ordered before or the same as the second in a lexicographical ordering.
ja: 語彙筆記的順序において最初のタプルが２番目の前またはそれと同じ順序かかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether the first tuple is ordered before the second in a lexicographical ordering.
ja: 語彙筆記的順序において最初のタプルが２番目の前の順序かかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether the given element is contained within the range.
ja: 与えられた要素がこの範囲内に含まれるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given keys are equal.
ja: 与えられたキーが等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given object is known to have a single strong reference.
ja: あるブール値を返して、与えられたオブジェクトが１つだけ強い参照を持つことを知られるかどうかを指し示します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are equivalent to the elements in another sequence, using the given predicate as the equivalence test.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同等かどうかを、与えられた述部を同等性テストとして使って指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are the same as the elements in another sequence.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同じかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains an element that satisfies the given predicate.
ja: 指定された述部を満足させるある要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains the given element.
ja: 指定された要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the given predicate to compare elements.
ja: シーケンスが別のシーケンスの前に来るかどうかをある語彙筆記的順序（字典）順序において、与えられた述部を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the less-than operator (<) to compare elements.
ja: そのシーケンスが別のシーケンスの前に来るかどうかを、ある語彙筆記的順序（字典）順序において、より小さい演算子（<）を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two arguments are equal.
ja: ２つの引数が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two arguments are not equal.
ja: ２つの引数が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two given values are equal.
ja: ２つの与えられた値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two given values are not equal.
ja: ２つの与えられた値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this instance is equal to the given value.
ja: このインスタンスが与えられた値と等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this instance is less than or equal to the given value.
ja: このインスタンスが与えられた値より小さいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this instance is less than the given value.
ja: このインスタンスが与えられた値より小さいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this instance should precede or tie positions with the given value in an ascending sort.
ja: このインスタンスがある昇順ソートにおいて、与えられた値より前にくるまたは同じ位置かどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this range and the given range contain an element in common.
ja: この範囲と与えられた範囲がある要素を共通に含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain equivalent elements in the same order, using the given predicate as the equivalence test.
ja: このシーケンスともう一方のシーケンスが同等の要素を同じ順序で含むかどうかを、与えられた述部を同等テストとして使って、指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain the same elements in the same order.
ja: このシーケンスともう一方のシーケンスが同じ要素を同じ順序で含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two arguments match by value equality.
ja: あるブール値を返します、２つの引数が値等式によって一致するかどうかを指し示しています。

source: Returns a Boolean value indicating whether two arrays contain the same elements in the same order.
ja: ２つの配列が同じ要素を同じ順序で含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two indices wrap equal underlying indices.
ja: ２つのインデックスが等しい基礎をなすインデックスをラップするかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two ranges are equal.
ja: ２つの範囲が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two references point to different object instances.
ja: ２つの参照が異なるオブジェクトインスタンスを指しているかどうかを示すブール値を返します。

source: Returns a Boolean value indicating whether two references point to the same object instance.
ja: ２つの参照が同じオブジェクトインスタンスを指しているかどうかを示すブール値を返します。

source: Returns a Boolean value indicating whether two type-erased hashable instances wrap the same value.
ja: ２つの型消去ハッシュ可能インスタンスが同じ値をラップするかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether two types are identical.
ja: ２つの型が同一かどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two types are not identical.
ja: ２つの型が同一でないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are equal.
ja: ２つの値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether all elements produced by the asynchronous sequence satisfies the given predicate.
ja: あるブール値を返します、それは非同期シーケンスによって生み出される全ての要素がこの与えられた述部を満足させるかどうかを指し示します。

source: Returns a Boolean value that indicates whether the asynchronous sequence contains an element that satisfies the given predicate.
ja: あるブール値を返します、それは非同期シーケンスがこの与えられた述部を満足させる要素を含むかどうかを指し示します。

source: Returns a Boolean value that indicates whether the asynchronous sequence contains the given element.
ja: あるブール値を返します、それは非同期シーケンスがこの与えられた要素を含むかどうかを指し示します。

source: Returns a closed range that contains both of its bounds.
ja: それの境界の両方を含む完結範囲を返します。

source: Returns a copy of this range clamped to the given limiting range.
ja: 与えられた限界範囲に締め金具で留められる（制限を課される）、この範囲のコピーを返します。

source: Returns a half-open range that contains its lower bound but not its upper bound.
ja: それの下側の境界は含むがそれの上側の境界はそうしない半開範囲を返します。

source: Returns a lowercased version of this character.
ja: この文字のローワーケース版を返します。

source: Returns a new .dataCorrupted error using a constructed coding path and the given debug description.
ja: 新しい.dataCorruptedエラーを返します、組み立てられたコーディングパスと与えられたデバッグ説明を使っています。

source: Returns a new collection difference with associations between individual elements that have been removed and inserted only once.
ja: ただ一度だけ除去および挿入された個々の要素の間の関連性それらをもつある新しいコレクション差異を返します。

source: Returns a new dictionary containing only the key-value pairs that have non-nil values as the result of transformation by the given closure.
ja: 与えられたクロージャによる変換の結果として非nilを持つキー値ペアだけを含んでいる新しい辞書を返します。

source: Returns a new dictionary containing the key-value pairs of the dictionary that satisfy the given predicate.
ja: この辞書のキー値ペアで与えられた述部を満たすものを含んでいる新しい辞書を返します。

source: Returns a new dictionary containing the keys of this dictionary with the values transformed by the given closure.
ja: 与えられたクロージャによって変形された値とともに、この辞書のキーを含んでいる新しい辞書を返します。

source: Returns a new key path created by appending the given key path to this one.
ja: 与えられたキーパスをこのものに加えることによって作成された新しいキーパスを返します。

source: Returns a new string by concatenating the elements of the sequence, adding the given separator between each element.
ja: 各要素の間に与えられた分離子を加えて、シーケンスの要素を連結することによる新しい文字列を返します。

source: Returns a partial range extending upward from a lower bound.
ja: 下側の境界から上方に拡張している部分的な範囲を返します。

source: Returns a partial range up to, and including, its upper bound.
ja: それの上側の境界までの、そしてそれを含む部分的な範囲を返します。

source: Returns a partial range up to, but not including, its upper bound.
ja: それの上側の境界までの、しかしそれを含んでいない、部分的な範囲を返します。

source: Returns a pointer offset from this pointer by the specified number of instances.
ja: このポインタから指定された数のインスタンスだけオフセットしたポインタを返します。

source: Returns a pointer to the next consecutive instance.
ja: 次の隣接インスタンスへのポインタを返します。

source: Returns a pointer to the previous consecutive instance.
ja: 前の隣接インスタンスへのポインタを返します。

source: Returns a random Boolean value, using the given generator as a source for randomness.
ja: 無作為なブール値を返します、与えられた生成子を無作為さの出典として使います。

source: Returns a random Boolean value.
ja: 無作為なブール値を返します。

source: Returns a random element of the collection, using the given generator as a source for randomness.
ja: コレクションのある無作為な要素を返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a random element of the collection.
ja: コレクションのある無作為の要素を返します。

source: Returns a random value within the specified range, using the given generator as a source for randomness.
ja: 指定された範囲内のある無作為な値を返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a random value within the specified range.
ja: 指定された範囲内のある無作為の値を返します。

source: Returns a sequence by skipping the initial, consecutive elements that satisfy the given predicate.
ja: 与えられた述部を満たす、冒頭の、隣接する要素を飛ばすことによるあるシーケンスを返します。

source: Returns a sequence containing all but the given number of final elements.
ja: 与えられた数の末尾要素以外すべてを含んでいるあるシーケンスを返します。

source: Returns a sequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいるあるシーケンスを返します。

source: Returns a sequence containing the initial, consecutive elements that satisfy the given predicate.
ja: 与えられた述部を満たす、冒頭の、隣接する要素を含んでいるあるシーケンスを返します。

source: Returns a sequence formed from first and repeated lazy applications of next.
ja: firstからそして繰り返しnextを遅延適用して形成されたシーケンスを返します。

source: Returns a sequence formed from repeated lazy applications of next to a mutable state.
ja: 繰り返しnextを可変のstateに遅延適用することから形成されたシーケンスを返します。

source: Returns a sequence from a starting value to, but not including, an end value, stepping by the specified amount.
ja: 指定の量だけ歩を進めて、始まりの値から終わりの値まで、しかしそれは含めないシーケンスを返します。

source: Returns a sequence from a starting value toward, and possibly including, an end value, stepping by the specified amount.
ja: 指定の量だけ歩を進めて、始まりの値から終わりの値の方へ、そしてもしかするとそれを含めるシーケンスを返します。

source: Returns a sequence of pairs (n, x), where n represents a consecutive integer starting at zero and x represents an element of the sequence.
ja: ペア (n, x) のシーケンスを返します、そこでnはゼロで開始する連続した数を表して、xはシーケンスの要素を表します。

source: Returns a sequence, up to the specified maximum length, containing the initial elements of the sequence.
ja: 指定された最大長まで、そのシーケンスの冒頭の要素を含んでいる、あるシーケンスを返します。

source: Returns a string read from standard input through the end of the current line or until EOF is reached.
ja: 標準入力から現在の行の終わりまでまたはEOFが到達されるまで読み込んだ文字列を返します。

source: Returns a subsequence by skipping elements while predicate returns true and returning the remaining elements.
ja: predicateがtrueを返す間は要素を飛ばして残りの要素を返すことによって、ある下位シーケンスを返します。

source: Returns a subsequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the specified number of final elements.
ja: 指定された数の末尾要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing the initial elements until predicate returns false and skipping the remaining elements.
ja: predicateがfalseを返すまで冒頭の要素を含んでいて残りの要素を飛ばしている、ある下位シーケンスを返します。

source: Returns a subsequence from the specified position to the end of the collection.
ja: 指定された位置からコレクションの終わりまでの下位シーケンスを返します。

source: Returns a subsequence from the start of the collection through the specified position.
ja: コレクションの始まりから指定された位置までも含む下位シーケンスを返します。

source: Returns a subsequence from the start of the collection up to, but not including, the specified position.
ja: コレクションの始まりから指定された位置まで、しかしそれは含めない下位シーケンスを返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの末尾の要素を含めて返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the sequence.
ja: 下位シーケンスを、指定された最大長まで、シーケンスの末尾の要素を含めて返します。

source: Returns a subsequence, up to the specified maximum length, containing the initial elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの冒頭の要素を含めて返します。

source: Returns a tuple containing the high and low parts of the result of multiplying this value by the given value.
ja: この値を指定の値で掛ける結果の高および低部分を含んでいるタプルを返します。

source: Returns a tuple containing the quotient and remainder obtained by dividing the given value by this value.
ja: 与えられた値をこの値で割ることで入手される商と余りを含んでいるタプルを返します。

source: Returns a tuple containing the quotient and remainder of dividing the given value by this value.
ja: 与えられた値をこの値で除算した商と余りを含んでいるタプルを返します。

source: Returns a value that is offset the specified distance from this value.
ja: 指定の隔たりをこの値からオフセットされたある値を返します。

source: Returns a view presenting the elements of the collection in reverse order.
ja: コレクションの要素を逆順に表しているある見方を返します。

source: Returns an array containing the concatenated results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果を連結したものを含んでいる配列を返します。

source: Returns an array containing the elements of this sequence in reverse order.
ja: このシーケンスの要素を逆順に含んでいる配列を返します。

source: Returns an array containing the non-nil results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果で非-nilのものを含んでいる配列を返します。

source: Returns an array containing the results of mapping the given closure over the sequence’s elements.
ja: 与えられたクロージャをシーケンスのもつ要素全体にわたってマップする結果を含んでいる配列を返します。

source: Returns an array containing, in order, the elements of the sequence that satisfy the given predicate.
ja: 指定された述部を満足させるものであるシーケンスの要素を、順序通りに、含んでいる配列を返します。

source: Returns an asynchronous sequence, containing the initial, consecutive elements of the base sequence that satisfy the given error-throwing predicate.
ja: ある非同期シーケンスを返します、基底シーケンスの冒頭の、連続する要素いくつかを含んでいます、それらは与えられたエラースロー述部を満たすものです。

source: Returns an asynchronous sequence, containing the initial, consecutive elements of the base sequence that satisfy the given predicate.
ja: ある非同期シーケンスを返します、基底シーケンスの冒頭の、連続する要素いくつかを含んでいます、それらは与えられた述部を満たすものです。

source: Returns an asynchronous sequence, up to the specified maximum length, containing the initial elements of the base asynchronous sequence.
ja: 指定された最大長まで、その基底非同期シーケンスの冒頭の要素を含んでいる、ある非同期シーケンスを返します。

source: Returns an empty iterator.
ja: 空のイテレータを返します。

source: Returns an encoding container appropriate for holding a single primitive value.
ja: 単一プリミティブ値を保持するのに適切なエンコーディングコンテナを返します。

source: Returns an encoding container appropriate for holding multiple unkeyed values.
ja: 複数のキー付けされない値を保持するのに適切なエンコーディングコンテナを返します。

source: Returns an encoding container appropriate for holding multiple values keyed by the given key type.
ja: 与えられたキー型によってキー付けされる複数の値を保持するのに適切なエンコーディングコンテナを返します。

source: Returns an index that is the specified distance from the given index, unless that distance is beyond a given limiting index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します、その隔たりが与えられた限界インデックスを越えない限りは。

source: Returns an index that is the specified distance from the given index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します。

source: Returns an iterator over the dictionary’s key-value pairs.
ja: 辞書のキー値ペアすべてを対象とするイテレータを返します。

source: Returns an iterator over the elements of the collection.
ja: コレクションの要素すべてを対象としたイテレータを返します。

source: Returns an iterator over the elements of this collection.
ja: このコレクションの要素すべてを対象としたイテレータを返します。

source: Returns an iterator over the elements of this sequence.
ja: このシーケンスの要素すべてを対象としたあるイテレータを返します。

source: Returns an uppercased version of this character.
ja: この文字のアッパーケース版を返します。

source: Returns nil if from is nil.
ja: fromがnilならばnilを返します。

source: Returns the absolute value of the given number.
ja: 与えられた数の絶対値を返します。

source: Returns the additive inverse of the specified value.
ja: 指定された値の加法の逆元を返します。

source: Returns the bits of the given instance, interpreted as having the specified type.
ja: 与えられたインスタンスのビットを返します、指定された型を持つと解釈されます。

source: Returns the concatenated elements of this sequence of sequences, inserting the given separator between each element.
ja: 各要素の間に与えられた分離子を挿入して、このシーケンスに属する複数のシーケンスの要素を鎖状に連結して返します。

source: Returns the data stored in this decoder as represented in a container appropriate for holding a single primitive value.
ja: このデコーダの中に格納されるデータを、単一プリミティブ値を保持するのに適したコンテナの中に表現される通りに返します。

source: Returns the data stored in this decoder as represented in a container appropriate for holding values with no keys.
ja: このデコーダの中に格納されるデータを、キーなしで値を保持するのに適したコンテナの中に表現される通りに返します。

source: Returns the data stored in this decoder as represented in a container keyed by the given key type.
ja: このデコーダの中に格納されるデータを、与えられたキー型によってキー付けされるコンテナの中に表現された通りに返します。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection, using the given predicate as an equivalence test.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異を返します、与えられた述部を同等性テストとして使います。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異を返します。

source: Returns the difference obtained by subtracting the given value from this value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: 与えられた値をこの値から減じることで入手される差、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the difference of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の差を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the distance between two indices.
ja: ２つのインデックス間の隔たりを返します。

source: Returns the distance from this pointer to the given pointer, counted as instances of the pointer’s Pointee type.
ja: このポインタから与えられたポインタまでの隔たりを返します、ポインタのもつPointee型のインスタンスとして数えられます。

source: Returns the distance from this value to the given value, expressed as a stride.
ja: この値から特定の値までの隔たりを返します、ストライドとして表されます。

source: Returns the dynamic type of a value.
ja: ある値の動的型を返します。

source: Returns the elements of the sequence, shuffled using the given generator as a source for randomness.
ja: シーケンスの要素を返します、与えられた生成子を無作為さの出典として使って混ぜ合わされます。

source: Returns the elements of the sequence, shuffled.
ja: 入れ替えた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted using the given predicate as the comparison between elements.
ja: 与えられた述部を要素間の比較として使ってソートされた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted.
ja: シーケンスに属する要素を、ソートして返します。

source: Returns the elements of this sequence of sequences, concatenated.
ja: このシーケンスに属する複数のシーケンスの要素を、鎖状に連結して返します。

source: Returns the first element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たすこのシーケンスの最初の要素を返します。

source: Returns the first index in which an element of the collection satisfies the given predicate.
ja: 最初のインデックスで、それにおけるコレクションの要素が与えられた述部を満足させるものを返します。

source: Returns the first index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最初のインデックスを返します。
